Repository: vakesz/Glasstual
Catalog: Sources/App/Features/MainWindow/Input/SlashCommands.xcstrings
Source language: en
Languages: de, hu

# syntax-channel-mask-flags
source: <channel|mask> [flags]
de: <Kanal|Maske> [Flags]
hu: <csatorna|maszk> [jelzők]

# syntax-channel-message
source: [channel] <message>
de: [Kanal] <Nachricht>
hu: [csatorna] <üzenet>

# syntax-channel-nickname
source: [channel] <nickname>
de: [Kanal] <Nickname>
hu: [csatorna] <becenév>

# syntax-channel-nickname-reason
source: [channel] <nickname> [reason]
de: [Kanal] <Nickname> [Grund]
hu: [csatorna] <becenév> [indok]

# syntax-channel-optional
source: [channel]
de: [Kanal]
hu: [csatorna]

# syntax-channel-reason
source: [channel] [reason]
de: [Kanal] [Grund]
hu: [csatorna] [indok]

# syntax-channels
source: <channel> [more channels]
de: <Kanal> [weitere Kanäle]
hu: <csatorna> [további csatornák]

# syntax-channels-keys
source: [channel[,channel]] [key[,key]]
de: [Kanal[,Kanal]] [Schlüssel[,Schlüssel]]
hu: [csatorna[,csatorna]] [kulcs[,kulcs]]

# syntax-chat-send-nickname-path
source: chat <nickname> | send <nickname> <path>
de: chat <Nickname> | send <Nickname> <Pfad>
hu: chat <becenév> | send <becenév> <útvonal>

# syntax-comment
source: [reason]
de: [Grund]
hu: [indok]

# syntax-count
source: [count]
de: [Anzahl]
hu: [darabszám]

# syntax-flags-arguments
source: [flags] [arguments]
de: [Flags] [Argumente]
hu: [jelzők] [argumentumok]

# syntax-help-enable-disable-feature
source: help | enable|disable [-a] "feature"
de: help | enable|disable [-a] "Funktion"
hu: help | enable|disable [-a] "funkció"

# syntax-irc-line
source: <IRC line>
de: <IRC-Zeile>
hu: <IRC-sor>

# syntax-mask-duration-reason
source: <+|-><mask|nickname> [duration] [reason]
de: <+|-><Maske|Nickname> [Dauer] [Grund]
hu: <+|-><maszk|becenév> [időtartam] [indok]

# syntax-mask-nickname
source: [<+|-><mask|nickname>]
de: [<+|-><Maske|Nickname>]
hu: [<+|-><maszk|becenév>]

# syntax-mask-nickname-reason
source: <+|-><mask|nickname> [reason]
de: <+|-><Maske|Nickname> [Grund]
hu: <+|-><maszk|becenév> [indok]

# syntax-message
source: <message>
de: <Nachricht>
hu: <üzenet>

# syntax-message-targets
source: <target[,target]> <message>
de: <Ziel[,Ziel]> <Nachricht>
hu: <cél[,cél]> <üzenet>

# syntax-name-fragment
source: <name fragment>
de: <Namensteil>
hu: <névrészlet>

# syntax-nickname-command-arguments
source: <nickname> <command> [arguments]
de: <Nickname> <Befehl> [Argumente]
hu: <becenév> <parancs> [argumentumok]

# syntax-nickname-message
source: <nickname> [message]
de: <Nickname> [Nachricht]
hu: <becenév> [üzenet]

# syntax-nickname-reason
source: <nickname> [reason]
de: <Nickname> [Grund]
hu: <becenév> [indok]

# syntax-nicknames
source: <nickname> [more nicknames]
de: <Nickname> [weitere Nicknames]
hu: <becenév> [további becenevek]

# syntax-nicknames-channel
source: <nickname> [more nicknames] [channel]
de: <Nickname> [weitere Nicknames] [Kanal]
hu: <becenév> [további becenevek] [csatorna]

# syntax-operator-message
source: [channel] <message>
de: [Kanal] <Nachricht>
hu: [csatorna] <üzenet>

# syntax-password
source: <password>
de: <Passwort>
hu: <jelszó>

# syntax-real-name
source: <real name>
de: <richtiger Name>
hu: <valódi név>

# syntax-seconds-repeat-command
source: <seconds> [repeat] <command> | help | list | stop|restart|remove <ID>
de: <Sekunden> [Wiederholungen] <Befehl> | help | list | stop|restart|remove <ID>
hu: <másodperc> [ismétlés] <parancs> | help | list | stop|restart|remove <azonosító>

# syntax-sound
source: <sound name>
de: <Klangname>
hu: <hang neve>

# syntax-subcommand-target-arguments
source: <subcommand> <target> [arguments]
de: <Unterbefehl> <Ziel> [Argumente]
hu: <alparancs> <cél> [argumentumok]

# syntax-target-flags-arguments
source: [target] [flags] [arguments]
de: [Ziel] [Flags] [Argumente]
hu: [cél] [jelzők] [argumentumok]

# syntax-target-optional
source: [target]
de: [Ziel]
hu: [cél]

# syntax-topic
source: [channel] [topic]
de: [Kanal] [Thema]
hu: [csatorna] [téma]

# syntax-nickname
source: <nickname>
hu: <becenév>

# syntax-nickname-optional
source: [nickname]
hu: [becenév]

# syntax-server-optional
source: [server]
hu: [kiszolgáló]
